## Feature Transformation
In this workshop, we are working on the dataset: load_small.csv

1. Import data
2. Access data
3. Handle missing data
    - Drop missing data
    - Fill by other values
4. Label encoding
5. One-hot encoding
6. Normalization

Data set: loan_small.csv

### 1. Import data

In [1]:
# Import libraries
import pandas as pd

In [2]:
# Read data from the csv file
dataset = pd.read_csv('loan_small.csv')
dataset.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y

### 2. Access data

In [3]:
# Access the data using iloc. 
# iloc[row range, column range]
# iloc[from_row_index: to_row_index+1, from_column_index:to_column_index+1]
# Example - Get first three rows from the second and third column
subset = dataset.iloc[0:3, 1:3]
subset

  Gender  ApplicantIncome
0    NaN           5849.0
1   Male           4583.0
2   Male           3000.0

In [4]:
# Access the data using column names
# dataframe[[col1,col2...]]
# Get all rows of the column Gender and ApplicantIncome
subset2 = dataset[['Gender', 'ApplicantIncome']]
subset2

    Gender  ApplicantIncome
0      NaN           5849.0
1     Male           4583.0
2     Male           3000.0
3   Female           2583.0
4     Male              NaN
5     Male           5417.0
6     Male           2333.0
7   Female           3036.0
8     Male           4006.0
9     Male          12841.0
10  Female           3200.0
11    Male           2500.0
12  Female              NaN
13    Male           1853.0
14    Male           1299.0
15    Male           4950.0

In [5]:
# display a small set of data for quick check on a large data
dataset.head(5)

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y

In [6]:
# Get the Shape of the dataframe (Row x Columns)
dataset.shape

(16, 7)

In [7]:
# Get column names of the dataframe
dataset.columns

Index(['Loan_ID', 'Gender', 'ApplicantIncome', 'CoapplicantIncome',
       'LoanAmount', 'Area', 'Loan_Status'],
      dtype='object')

In [8]:
# Store column names of the dataframe in a list
column_list = dataset.columns.to_list()

### 3. Handle missing data

In [8]:
# -------------------------------------------------------------
# Handling missing values
# -------------------------------------------------------------

# Find out columns with missing values with their count
dataset.isnull().sum(axis=0)

Loan_ID              0
Gender               1
ApplicantIncome      2
CoapplicantIncome    1
LoanAmount           3
Area                 1
Loan_Status          1
dtype: int64

In [10]:
# Drop all the rows with missing values
dataset_clean = dataset.dropna()
dataset_clean.isnull().sum(axis=0)

Loan_ID              0
Gender               0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Area                 0
Loan_Status          0
dtype: int64

In [9]:
# Drop all the rows with missing values of a particular column 
dataset_clean = dataset.dropna(subset=["Loan_Status"])
dataset_clean.isnull().sum(axis=0)

Loan_ID              0
Gender               1
ApplicantIncome      2
CoapplicantIncome    1
LoanAmount           3
Area                 1
Loan_Status          0
dtype: int64

In [11]:
# Copy the dataset
df = dataset.copy()
cols = ['Gender', 'Area', 'Loan_Status']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            16 non-null     object
 1   Gender             15 non-null     object
 2   ApplicantIncome    14 non-null     float64
 3   CoapplicantIncome  15 non-null     float64
 4   LoanAmount         13 non-null     float64
 5   Area               15 non-null     object
 6   Loan_Status        15 non-null     object
dtypes: float64(3), object(4)
memory usage: 1.0+ KB

In [12]:
# Replace categorical values with mode
df[cols] = df[cols].fillna(df.mode().iloc[0]) # iloc[0] means take the first value of mode, which is the most frequent mode.
df.isnull().sum(axis=0)
df.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,Male,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,semi,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,Y
4,LP001008,Male,NaN,0.0,141.0,urban,Y

In [13]:
# Replace missing numerical values with mean
cols2 = ['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount']

In [14]:
# Replace numerical values with mean
df[cols2] = df[cols2].fillna(df.mean())
df.isnull().sum(axis=0)
df.shape

(16, 7)

### 4. Label encoding

In [15]:
#
# ---------------------------------------------------------
# label encoding - Convert Categorical to Numerical values
# ---------------------------------------------------------

# Get datatypes of all the columns of the dataframe
df.dtypes

Loan_ID               object
Gender                object
ApplicantIncome      float64
CoapplicantIncome    float64
LoanAmount           float64
Area                  object
Loan_Status           object
dtype: object

In [16]:
# Convert string/object column types to categorical 
df[cols] = df[cols].astype('category')
df.dtypes

Loan_ID                object
Gender               category
ApplicantIncome       float64
CoapplicantIncome     float64
LoanAmount            float64
Area                 category
Loan_Status          category
dtype: object

In [17]:
# Convert string to numerical codes
for columns in cols:
    df[columns] = df[columns].cat.codes

In [18]:
df.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,1,5849.000000,0.000000,140.923077,2,1
1,LP001003,1,4583.000000,2509.333333,128.000000,1,0
2,LP001005,1,3000.000000,0.000000,66.000000,1,1
3,LP001006,0,2583.000000,2358.000000,120.000000,1,1
4,LP001008,1,4103.571429,0.000000,141.000000,2,1

In [19]:
df.dtypes

Loan_ID               object
Gender                  int8
ApplicantIncome      float64
CoapplicantIncome    float64
LoanAmount           float64
Area                    int8
Loan_Status             int8
dtype: object

### 5. One-hot encoding

In [20]:
# ---------------------------------------------------------
# Hot encoding or Dummy Variable Creation
# ---------------------------------------------------------

# Drop column Loan_ID using column name
df2 = dataset.drop(['Loan_ID'], axis=1)

In [21]:
# using get_dummies function of Pandas
df2 = pd.get_dummies(df2)
df2.shape
df2.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Gender_Female,Gender_Male,Area_rural,Area_semi,Area_urban,Loan_Status_N,Loan_Status_Y
0,5849.0,0.0,NaN,0,0,0,0,1,0,1
1,4583.0,NaN,128.0,0,1,0,1,0,1,0
2,3000.0,0.0,66.0,0,1,0,0,0,0,1
3,2583.0,2358.0,120.0,1,0,0,1,0,0,0
4,NaN,0.0,141.0,0,1,0,0,1,0,1

In [22]:
# Avoid dummy variable trap using drop_first
# refer to lecture notes - appendix for the detmails of dummy variable trap
# drop_first: whether to get k-1 dummies out of k categorical levels by removing the first level
# useful for dependent variable and multiple colinearity variables
df3 = dataset.drop(['Loan_ID'], axis=1)
df3 = pd.get_dummies(df3, drop_first=True)
df3.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Gender_Male,Area_semi,Area_urban,Loan_Status_Y
0,5849.0,0.0,NaN,0,0,1,1
1,4583.0,NaN,128.0,1,1,0,0
2,3000.0,0.0,66.0,1,0,0,1
3,2583.0,2358.0,120.0,0,1,0,0
4,NaN,0.0,141.0,1,0,1,1

### 6. Normalization

In [23]:
# ---------------------------------------------------------
# Data Normalization using Standardscaler and MinMax 
# ---------------------------------------------------------


dataset_clean.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
4,LP001008,Male,NaN,0.0,141.0,urban,Y
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y

In [29]:
# extract data to scale, apply only on numeric columns
data_to_scale = dataset_clean.iloc[:, 2:5]

In [30]:
# Import the StandardScaler class
from sklearn.preprocessing import StandardScaler

In [31]:
# Create an object of the class StandardScaler
scaler = StandardScaler()

In [34]:
# Fit and Transform the data for normalization
ss_scaler = scaler.fit_transform(data_to_scale)

In [35]:
# MinMax Normalization of the data
from sklearn.preprocessing import minmax_scale

In [36]:
# Fit and Transform the data for MinMax normalization
mm_scaler = minmax_scale(data_to_scale)

In [34]:
mm_scaler

array([[0.39421244, 0.        ,        nan],
       [0.28452608,        nan, 0.33433735],
       [0.14737481, 0.        , 0.14759036],
       [       nan, 0.        , 0.37349398],
       [0.35678392, 0.38256747, 0.75301205],
       [0.08958586, 0.13822028,        nan],
       [0.15049385, 0.22830051, 0.4246988 ],
       [0.23453474, 0.13913202, 0.45481928],
       [1.        , 1.        , 1.        ],
       [0.16470282, 0.06382203, 0.15963855],
       [0.10405476, 0.16776076, 0.27710843],
       [       nan, 0.73905908,        nan],
       [0.04799861, 0.25893508, 0.29216867],
       [0.        , 0.09901532, 0.        ],
       [0.31632299, 0.        , 0.3253012 ]])